//年間の月別気温、平均、最高、最低気温を摂氏および華氏で表示するプログラム
#include<stdio.h>
int main(void) {
	int month[12] = { 5,0,3,10,16,21,24,25,19,13,7,0 };  //月別気温の宣言
	int i;  //ループカウンタの宣言
	int sum = 0;  //平均気温用の変数

	//月別気温の表示(華氏は最後に切り捨てが行われるように計算する)
	for (i = 0; i < 12; i++) {
		printf("%d月：%d(%d)\n", i + 1, month[i], (9 * month[i] + 32 * 5) / 5);
	}
	printf("-----------\n");

	//12カ月分の気温の合計を出し、平均気温を表示(同様に華氏の計算に注意する)
	for (i = 0; i < 12; i++) {
		sum = sum + month[i];
	}
	printf("平均：%d(%d)\n", sum / 12, (9 * sum + 32 * 5 * 12) / (5 * 12));

	int max = sum / 12, min = sum / 12;  //最高気温、最低気温用の変数の宣言(初期値は平均気温)
	//12カ月分の気温を比較し、最高、最低気温を定める
	for (i = 0; i < 12; i++) {
		if (max < month[i]) {
			max = month[i];
		}
		if (min > month[i]) {
			min = month[i];
		}
	}
	//最高、最低気温の表示
	printf("最高：%d(%d)\n", max, (9 * max + 32 * 5) / 5);
	printf("最低：%d(%d)\n", min, (9 * min + 32 * 5) / 5);

	//終了の表示
	printf("\n以上\n20xx年の月平均気温(摂氏,括弧内は華氏)");
}
